logs/artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 15:07:13(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 15:07:14(-0300)

--------------------------------------
Metrics for period to: 15:07:20(-0300) (width: 1.679s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 602/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 51
  median: ...................................................................... 16
  p95: ......................................................................... 25.8
  p99: ......................................................................... 40
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 521.2
  max: ......................................................................... 1021.4
  median: ...................................................................... 889.1
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 15:07:17(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 602/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 51
  median: ...................................................................... 16
  p95: ......................................................................... 25.8
  p99: ......................................................................... 40
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 521.2
  max: ......................................................................... 1021.4
  median: ...................................................................... 889.1
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4